<?php
namespace TM\Type;

/**
 * Часть урла
 */
class Url_Part extends \TM\Column
{
	public $type_sql = "varchar(255)";
	public $type_php = "string";
	public $prepare = "mb_strtolower";

	public function check ($value) : bool
	{
		if (!is_string($value))
			throw new \Exception("Не является строкой.");

		/* В нижний регистр */
		$value = mb_strtolower($value);

		/* «.» или «..» */
		if ($value === "." or $value === "..")
			throw new \Exception("Урл не может быть указан как «.» или «..».");

		/* Недопустимые символы */
		$value = strtr
		(
			$value,
			[
				'0'=>'', '1'=>'', '2'=>'', '3'=>'', '4'=>'', '5'=>'', '6'=>'', '7'=>'', '8'=>'', '9'=>'',
				'a'=>'', 'b'=>'', 'c'=>'', 'd'=>'', 'e'=>'', 'f'=>'', 'g'=>'', 'h'=>'', 'i'=>'', 'j'=>'',
				'k'=>'', 'l'=>'', 'm'=>'', 'n'=>'', 'o'=>'', 'p'=>'', 'q'=>'', 'r'=>'', 's'=>'', 't'=>'',
				'u'=>'', 'v'=>'', 'w'=>'', 'x'=>'', 'y'=>'', 'z'=>'',
				'а'=>'', 'б'=>'', 'в'=>'', 'г'=>'', 'д'=>'', 'е'=>'', 'ё'=>'', 'ж'=>'', 'з'=>'', 'и'=>'',
				'й'=>'', 'к'=>'', 'л'=>'', 'м'=>'', 'н'=>'', 'о'=>'', 'п'=>'', 'р'=>'', 'с'=>'', 'т'=>'',
				'у'=>'', 'ф'=>'', 'х'=>'', 'ц'=>'', 'ч'=>'', 'ш'=>'', 'щ'=>'', 'ъ'=>'', 'ы'=>'', 'ь'=>'',
				'э'=>'', 'ю'=>'', 'я'=>'',
				'_'=>'', '-'=>'', '.'=>'', ' '=>'_'
			]
		);

		if ($value !== "")
			throw new \Exception("Допускаются символы: 0-9,a-z,а-я,«_»,«-»,«.» .");

		return true;
	}
}
?>